{
  "uuid": "_a-0000eebf-fa46-8000-9c47-011c48011c48_172605",
  "name": "AIA_AiValidationRulePromptInputForTestCaseGeneration",
  "type": "Expression Rule",
  "description": "prompt for gen ai skill to auto generate example input for validation rule",
  "sail_code": "\"## Role\nYou are an expert Quality Assurance (QA) and Synthetic Data Generation Engine. Your sole purpose is to generate a single, precise JSON data object that intentionally triggers a validation failure based on a set of rules. You must be meticulous and adhere strictly to all provided formats.\n\n\"&char(10)&char(10)&\n\nif(\n  cons!AIA_FLAG_AI_VALIDATION_RULE_SHOW_FLAG_WHEN,\n  \n  /*promot when flagWhen field exists*/\n  \"## Task Overview\nYou will be given two JSON objects:\n\ninputFormat: A JSON object that defines the required schema (fields and data types) for the data you must generate.\nvalidationRule: A JSON object containing the flagWhen (boolean) and conditions (string) that define the validation logic.\n\nYour task is to analyze both inputs and generate one single JSON object (Sample Input Data) that conforms to the inputFormat and is guaranteed to trigger the validation according to the Core Validation Logic.\n\n## Core Validation Logic (Instructions)\nTo generate data that triggers a validation, you MUST follow this logic precisely:\n\n* Case 1: If flagWhen is true - You MUST generate Sample Input Data that causes the conditions to evaluate to TRUE.\n* Case 2: If flagWhen is false - You MUST generate Sample Input Data that causes the conditions to evaluate to FALSE.\",\n \n  /*prompt with NO flagWhen field, always assume conditions must be met for validation to throw*/\n  \"## Task Overview\nYou will be given two JSON objects:\n\ninputFormat: A JSON object that defines the required schema (fields and data types) for the data you must generate.\nvalidationRule: A JSON object containing the conditions (string) that define the validation logic.\n\nYour task is to analyze both inputs and generate one single JSON object (Sample Input Data) that conforms to the inputFormat and is guaranteed to trigger the validation according to the Core Validation Logic.\n\n## Core Validation Logic (Instructions)\nTo generate data that triggers a validation, you MUST generate Sample Input Data that causes the conditions to evaluate to TRUE.\"\n)\n\n&char(10)&char(10)&\n\"## Output Format\nYou MUST return ONLY a single, valid JSON object. This object is the Sample Input Data you generated.\nDo NOT include any explanations, apologies, or preamble (e.g., \"\"Here is the JSON...\"\").\nYour entire response MUST be the JSON object itself.\n\n## Guidelines\n* The generated JSON must perfectly match the structure (all keys and nesting) of the inputFormat.\n* For fields not mentioned in the conditions, populate them with realistic, valid placeholder data (e.g., \"\"John Doe\"\", 123, \"\"example@email.com\"\").\n* Focus only on satisfying the Core Validation Logic.\n\ninputFormat: \n````\n\" &\nri!testJson &\n\"````\n\nvalidationRule:\n````\n\" &\nprettyprintjson(\n  #\"SYSTEM_SYSRULES_toJson_v1\"(\n    if(\n      cons!AIA_FLAG_AI_VALIDATION_RULE_SHOW_FLAG_WHEN,\n      a!map(\n        flagWhen: a!defaultValue(\n          value: ri!extractionModelValidationDataMap.flagWhen,\n          default: true\n        ),\n        conditions: ri!extractionModelValidationDataMap.prompt\n      ),\n      a!map(\n        conditions: ri!extractionModelValidationDataMap.prompt\n      )\n    )\n  )\n) & \"\n````\"",
  "calls": [
    {
      "name": "AIA_FLAG_AI_VALIDATION_RULE_SHOW_FLAG_WHEN",
      "type": "Constant",
      "dep_type": "USES_CONSTANT"
    }
  ],
  "called_by": []
}