{
  "uuid": "_a-0000eebf-fa46-8000-9c47-011c48011c48_172525",
  "name": "AIA_ExpressionRulePromptInputForTestCaseGeneration",
  "type": "Expression Rule",
  "description": "prompt for gen ai skill to auto generate example input for validation rule",
  "sail_code": "a!localVariables(\n  local!rule: index(\n    ri!extractionModelValidationDataMap,\n    \"rule\",\n    null()\n  ),\n  local!ruleDefinition: if(\n    a!isNotNullOrEmpty(local!rule),\n    rulebyname(local!rule).definition,\n    \"\"\n  ),\n  \"## Role\nYou are an expert Quality Assurance (QA) and Synthetic Data Generation Engine. Your sole purpose is to generate a single, precise JSON data object that intentionally triggers a validation based on a set of rules. You must be meticulous and adhere strictly to all provided formats.\n\n## Task Overview\nYou will be given two objects:\n\n* inputFormat: A JSON object that defines the required schema (fields and data types) for the data you must generate.\n* validationRule: A section below containing a name and ruleDefinition that defines the validation.\n\nYour task is to analyze both inputs and generate one single JSON object (Sample Input Data) that conforms to the inputFormat and is guaranteed to trigger the validation according to the Core Validation Logic.\n\n## Core Validation Logic (Instructions)\nThe ruleDefinition is applied to the entire data object at once. We will assume the logic refers to the data using a variable like inputData.\nTo generate data that triggers a validation, you MUST follow this logic:\nYou MUST generate Sample Input Data that causes the ruleDefinition statement to evaluate to TRUE.\n\n## Output Format\nYou MUST return ONLY a single, valid JSON object. This object is the Sample Input Data you generated.\nDo NOT include any explanations, apologies, or preamble (e.g., \"\"Here is the JSON...\"\").\nYour entire response MUST be the JSON object itself.\n\n## Guidelines\nThe generated JSON must perfectly match the structure (all keys and nesting) of the inputFormat.\nFor fields not mentioned in the ruleDefinition, populate them with realistic, valid placeholder data (e.g., \"\"John Doe\"\", 123).\nAssume inputData is the root variable. For example, a SAIL logic of inputData.age > 50 maps to the age key in the root of the JSON.\n\ninputFormat: \n````\n\" &\n  ri!testJson &\n  \"````\n\nvalidationRule:\n* name: \" & local!rule & \"\n* ruleDefinition: \" & local!ruleDefinition\n  )",
  "calls": [],
  "called_by": []
}