{
  "_metadata": {
    "bundle_id": "AS_GSS_Extract_Document_for_Doc_Chat"
  },
  "objects": {
    "_a-0000ef29-4c7b-8000-9e6a-011c48011c48_18163117": {
      "name": "AS_GSS_extractDocumentRuntimePromptDocChat",
      "type": "Expression Rule",
      "sail_code": "concat(\n  \"You are an expert AI assistant that synthesizes information and responds in a structured format. \nYour primary goal is to provide concise, accurate answers based only on the provided document content.\",\n  \"<question>\",\n  ri!chat,\n  \"</question>\",\n  \"<content>\",\n  \"Use the entire document as content\",\n  \"</content>\",\n  \"Instructions:\nYour entire response MUST BE a single, valid JSON object.\n- Do not include any preamble, explanation, or text outside of the JSON structure.\n- The JSON object must have a single key: 'answer', which holds a string value.\n- The 'answer' should be a concise, synthesized response to the user's question.\n- The 'answer' string itself must be valid HTML, formatted as follows:\n-- For lists, you can use either HTML unordered list tags (<ul> and <li>) or ordered list tags (<ol> and <li>) for numerical steps, as appropriate.\n-- For headings, use appropriate HTML heading tags (e.g., <h2>, <h3>) and ensure they are bold.\n-- To insert line breaks between paragraphs, use the <p> tag for new paragraphs or <br> for simple line breaks where appropriate.\n- If you add quotes, IT MUST BE A SINGLE QUOTE, not a double quote.\n- If the context does not contain enough information, the 'answer' must be: I am sorry, but the provided documents do not contain the information needed to answer your question.\n- Ensure the JSON has no trailing commas or unescaped characters.\"\n)"
    },
    "0004ef2d-7ac7-8000-e9d2-7f0000014e7a": {
      "name": "AS GSS Extract Document for Doc Chat",
      "type": "Process Model",
      "sail_code": "// Input: ?\n=pv!appianDocument\n\n// Input: ?\n= rule!AS_GSS_extractDocumentRuntimePromptDocChat(chat: pv!chat)\n\n// Input: ?\n=cons!AS_GSS_TXT_MODEL_ID_NATIVE_AI\n\n// Output: ?\nAC!Response"
    }
  }
}