{
  "uuid": "_a-0000ebaa-27e9-8000-9d43-011c48011c48_11482474",
  "name": "AS_GCM_DFARS_AcquisitionWeeklySyncSchedule_v1_default",
  "type": "Expression Rule",
  "description": "This rule represents the scheduling configuration of the DFARS sync process. Modify this rule to change the frequency or time at which the process runs.\n\n\n@customizable:1.0\n@category:BUSINESS_LOGIC\n@app:GAM.GCM",
  "sail_code": "/*\n\nDESCRIPTION: This rule represents the scheduling configuration of the DFARS sync process. \nModify this rule to change the frequency or time at which the process runs.\n\nDEFAULT BEHAVIOR: The DFARS sync process is scheduled to run every Sunday at 1:00 AM EST.\n\nCUSTOMIZATION STEPS: Configure a new DFARS sync schedule by changing the map configuration below. \nSee inline comments about what each field of the map represents.\n\n\nEXPECTED OUTPUT TYPE: Map, with fields `daysOfWeek`, `daysOfMonth`, `timeInEst`, `isDisabled`\n\nTITLE: Acquisition DFARS Weekly Sync Schedule\n\nNOTE: Avoid scheduling this process to run at the same time as the Acquisition FAR Weekly Sync Schedule\n\n*/\na!map(\n  /*A list of days of the week which to run this sync process.*/\n  /*Valid values: SUNDAY, MONDAY, TUESDAY, WEDNESDAY, THURSDAY, FRIDAY, SATURDAY*/\n  daysOfWeek: {\"SUNDAY\"},\n\n  /*A list of days of the month which to run this sync process.*/\n  /*Valid values: Any numbers between 1 and 31*/\n  daysOfMonth: {},\n\n  /*Note, generally you'd only configure daysOfWeek OR daysOfMonth, not both.*/\n\n  /*The 24-hour time in Eastern Standard Time when to run this process.*/\n  /*Generally this would be set during off-hours.*/\n  timeInEst: time(1, 0, 0),\n\n  /*If the following is set to true, the DFARS sync process won't run at all.*/\n  /*Note: This affects only the weekly sync process, individual sync for each clause may still be visible either way.\n  To disable both weekly and individual syncs completely use the 'Enable/Disable Acquisition DFARS Github Sync' option.*/\n  isDisabled: false\n)\n",
  "calls": [],
  "called_by": []
}