{
  "uuid": "_a-0000ea2f-ac11-8000-9bf4-011c48011c48_605600",
  "name": "CMGT_UTIL_VerifyRecaptcha_SaveLogic",
  "type": "Expression Rule",
  "description": "Rule to runs a!verifyRecaptcha() but accounts for scenarios where recaptcha is not actually configured, and is considered a \"success\" in those instances. See comments for more details.",
  "sail_code": "/*\nRuns a!verifyRecaptcha() but accounts for scenarios where recaptcha is not actually configured, \nand is considered a 'success' in those instances. See comments for more details.\n\nThere are 4 possible scenarios scenarios (detailed in the code below where they appear):\n\nERROR scenarios\n1 - Recaptcha evaluates successfully but the score is too low (considered non-human)\n2 - Recaptcha service fails to connect and recaptcha connected system is configured\n\nSUCCESS scenarios\n3 - Recaptcha evaluates successfully but the score is high enough (considered human)\n4 - Recaptcha service is not recognized because the recaptcha connected system is not configured\n    - This is considered 'success' because a designer deciding to not use recaptcha can be\n      accomplished by just removing the recaptcha connected system from the Portal design object,\n      in which case this will evaluate as a 'regular' saveInto\n    - The specific resulting error message of `fv!error` is what signifies this.\n*/\n#\"SYSTEM_SYSRULES_verifyRecaptcha\"(\n  onSuccess: a!match(\n    value: fv!score,\n    /* 0.3 is the recommended threshold for recaptcha score, but can be adjusted */\n    whenTrue: fv!value >= 0.3,\n    /*3*/\n    then: ri!onSuccess,\n    /*1*/\n    default: ri!onError\n  ),\n  onError: if(\n    tostring(fv!error) = \"Cannot successfully execute reCAPTCHA. reCAPTCHA is only available in Portals. Please ensure reCAPTCHA credentials have been configured correctly and test reCAPTCHA on your Portals page. See reCAPTCHA documentation here.\",\n    /*4*/\n    ri!onSuccess,\n    /*2*/\n    ri!onError\n  )\n)",
  "calls": [],
  "called_by": [
    {
      "name": "CMGT_SELF_SignUpDetails",
      "type": "Interface",
      "dep_type": "CALLS"
    },
    {
      "name": "CMGT_PortalPage_CheckCaseStatus",
      "type": "Interface",
      "dep_type": "CALLS"
    },
    {
      "name": "CMGT_Portal_Case_CreateCase_FormDisplayWrapper",
      "type": "Interface",
      "dep_type": "CALLS"
    }
  ]
}