{
  "uuid": "_a-0000ec3d-b406-8000-9bb2-011c48011c48_238443",
  "name": "CMGT_EXT_DATA_FraudulentTransactions_Comments",
  "type": "Expression Rule",
  "description": "Rule for creating Fraudulent Transactions comments",
  "sail_code": "{\n  /*Case Comments*/\n  /*Incorrect Amount Charged*/\n  a!map(\n    caseTitle: \"Incorrect Amount Charged\",\n    parentComment: a!map(\n      commentText: \"Could you please provide a copy of the credit card statement showing the incorrect amount charged? This will help us investigate and resolve the dispute promptly.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll retrieve the latest credit card statement from our records and forward you the relevant section showing the disputed amount.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"This statement should provide clarity on when the incorrect charge was processed.\",\n        linkedDocuments: \"Credit Card Transactions\"\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Incorrect Amount Charged\",\n    parentComment: a!map(\n      commentText: \"Has the receipt or invoice for the transaction showing the correct amount been located? It's important to compare this with the amount charged to identify discrepancies.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll check our financial records for the receipt or invoice related to the transaction.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"This document will help us verify the correct amount and compare it with the charge.\",\n        linkedDocuments: \"Receipt\"\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Incorrect Amount Charged\",\n    parentComment: a!map(\n      commentText: \"Are there any communications or correspondence regarding the transaction in question? This could include emails, letters, or notes that detail the agreed-upon amount versus what was charged.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll search our communication archives for any correspondence related to the transaction. This information will shed light on any discussions about the payment amount.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Any documented communication regarding the transaction will be instrumental in resolving the dispute. Let's gather all relevant information to present a comprehensive case.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Incorrect Amount Charged\",\n    parentComment: a!map(\n      commentText: \"Could you provide a screenshot or scan of the merchant's website or catalog showing the advertised price at the time of purchase? This will help verify the discrepancy.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll capture a screenshot of the merchant's website or catalog page displaying the advertised price at the time of purchase. This evidence will support our dispute.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Having visual documentation of the advertised price will strengthen our case. Once we obtain the screenshot, we can present it as part of our evidence.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Incorrect Amount Charged\",\n    parentComment: a!map(\n      commentText: \"Has the merchant's terms and conditions or billing policy been reviewed? This may provide insights into how charges are calculated and any potential discrepancies.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll review the merchant's terms and conditions or billing policy to understand their pricing structure. This will help us determine if any errors occurred.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Understanding the merchant's billing policies is crucial. Once we have clarity on their procedures, we can identify any inconsistencies in the charge.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Duplicate Transaction\"*/\n  a!map(\n    caseTitle: \"Duplicate Transaction\",\n    parentComment: a!map(\n      commentText: \"Could you please provide a copy of the credit card statement showing the duplicate transaction? This will help us verify the charges and initiate the dispute process.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Here is the latest credit card statement from our records and the duplicate transaction is highlighted for your review.\",\n        linkedDocuments: \"Duplicate Transaction Bank Statement\"\n      ),\n      a!map(\n        commentText: \"Identifying the exact date and amount of the duplicate charge is crucial. Once we have the statement, we can proceed with disputing the transaction.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Duplicate Transaction\",\n    parentComment: a!map(\n      commentText: \"Has the receipt or invoice for the original transaction been located? Comparing this with the duplicate charge will help us determine the discrepancy.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll search our financial records for the receipt or invoice related to the original transaction.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"This document will assist in identifying any discrepancies.\",\n        linkedDocuments: \"Duplicate Transaction Receipts\"\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Duplicate Transaction\",\n    parentComment: a!map(\n      commentText: \"Are there any communications or correspondence with the merchant regarding the transaction? This could include emails, letters, or notes detailing the duplicate charge.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll check our communication records for any correspondence with the merchant regarding the transaction. This information may shed light on the duplicate charge.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Duplicate Transaction\",\n    parentComment: a!map(\n      commentText: \"Reviewing any documented communication with the merchant will help us understand how the duplicate transaction occurred. Let's gather all relevant information.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {}\n  ),\n  /*ACH Payment Not Received*/\n  a!map(\n    caseTitle: \"ACH Payment Not Received\",\n    parentComment: a!map(\n      commentText: \"Team, it's crucial we address the issue of missing ACH payments on credit card accounts promptly. Let's strategize our approach.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Agreed. Should we start by compiling a comprehensive list of affected accounts?\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Yes. Do we have any initial insights into the root cause of these missing payments?\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"No. But we can check if we can find anything in this bank statement\",\n        linkedDocuments: \"Bank Statement\"\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"ACH Payment Not Received\",\n    parentComment: a!map(\n      commentText: \"I'll begin by gathering data from our systems to identify all accounts where ACH payments have not been processed.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Good idea.Let's prioritize accounts based on the time since the missed payment to handle the most urgent cases first.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"The following account holder has registered the first complaint\",\n        linkedDocuments: \"Payment Not Received Business Account Statement\"\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"ACH Payment Not Received\",\n    parentComment: a!map(\n      commentText: \"Once we have a list of affected accounts, what's our plan for communication and resolution?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Should we draft a standard communication template to notify customers about the missing payments?\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Do we need to set up a dedicated hotline or email address for customers to report missing payments?\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"ACH Payment Not Received\",\n    parentComment: a!map(\n      commentText: \"Let's discuss how we can prevent future occurrences of missing ACH payments. What improvements can we implement?\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Should we conduct regular audits of our ACH payment processes to identify potential gaps?\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Do we need to update our system alerts to notify us promptly of any missed payments?\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*ACH Transaction Error*/\n  a!map(\n    caseTitle: \"ACH Transaction Error\",\n    parentComment: a!map(\n      commentText: \"Could you please provide a copy of the bank statement showing the ACH transaction error? This will help us review the details and initiate the dispute process.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll retrieve the latest bank statement from our records and highlight the ACH transaction error for your review.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Here is the transaction history document for your review\",\n        linkedDocuments: \"Transaction History\"\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"ACH Transaction Error\",\n    parentComment: a!map(\n      commentText: \"Could you provide a screenshot or scan of the ACH transaction details from the online banking portal? This will help verify the erroneous transaction.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll capture a screenshot or scan of the ACH transaction details from the online banking portal. This evidence will support our dispute.\",\n        linkedDocuments: \"Transaction Error From Site\"\n      ),\n      a!map(\n        commentText: \"Having visual documentation of the ACH transaction details will strengthen our case\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"ACH Transaction Error\",\n    parentComment: a!map(\n      commentText: \"Has the bank's transaction history or logs been reviewed? This may provide insights into how the ACH error occurred and when it was processed.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll review the bank's transaction history or logs to understand the timing and details of the ACH error. This will help us address the issue.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Understanding the bank's transaction records and history is essential. Once we have this information, we can better explain and resolve the ACH error.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Task Comments*/\n  /*Credit Card Disputes (DEMO)*/\n  /*Intake Review*/\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Intake Review\",\n    parentComment: a!map(\n      commentText: \"Could you please provide a copy of the credit card statement showing the disputed transaction? This will help us initiate the intake review process and gather necessary details.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll retrieve the latest credit card statement from our records and highlight the disputed transaction for your review.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Having the credit card statement will enable us to accurately document the disputed amount and transaction details for the intake review.\",\n        linkedDocuments: {\n          \"Credit Card Transactions\",\n          \"Duplicate Transaction Bank Statement\"\n        }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Intake Review\",\n    parentComment: a!map(\n      commentText: \"Can you confirm the date and amount of the disputed transaction?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Yes, the disputed transaction occurred on last Friday\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Dispute Validity*/\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Dispute Validity\",\n    parentComment: a!map(\n      commentText: \"Could you please provide the contract or agreement related to the disputed transaction? This document is crucial for assessing the validity of the dispute.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll search our records for the contract or agreement pertaining to the disputed transaction. Once located, I'll provide you with a copy for review.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Having the contract or agreement will help us understand the terms and conditions agreed upon by both parties. It's essential for resolving the dispute.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Dispute Validity\",\n    parentComment: a!map(\n      commentText: \"Are there any communications or correspondence regarding the disputed transaction? This could include emails, letters, or notes detailing the issue.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll review our communication records for any correspondence related to the disputed transaction. This information may provide additional context.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Here is the Affidavit which has been found related to this case\",\n        linkedDocuments: { \"Affidavit\" }\n      )\n    }\n  ),\n  /*Chargeback Rights*/\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Chargeback Rights\",\n    parentComment: a!map(\n      commentText: \"We have initiated the chargeback process for the disputed transaction. Please ensure all relevant documents, such as the credit card statement and transaction receipts, are ready for submission.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I will confirm that the credit card statement and transaction receipts are prepared and organized for submission. Is there a specific deadline we need to meet?\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Chargeback Rights\",\n    parentComment: a!map(\n      commentText: \"I will double-check the documentation and ensure everything is in order for the chargeback process. \",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Please refer the charge back guide.It will help you.\",\n        linkedDocuments: \"Chargeback Guide\"\n      ),\n      a!map(\n        commentText: \"Should I include any additional information to strengthen our case?\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Request More Information*/\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Request More Information\",\n    parentComment: a!map(\n      commentText: \"This can be marked as not needed as the customer has provided enough documents\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {}\n  ),\n  /*Raise Chargeback*/\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Raise Chargeback\",\n    parentComment: a!map(\n      commentText: \"Have you attempted to resolve the issue directly with the merchant?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Yes, I contacted the merchant via email on May 20, 2023, but I have not received a response.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Raise Chargeback\",\n    parentComment: a!map(\n      commentText: \"Is your credit card information secure? Have you experienced any other unauthorized transactions recently?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Yes, my credit card information is secure. There have been no other unauthorized transactions.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Raise Chargeback\",\n    parentComment: a!map(\n      commentText: \"What outcome are you expecting from the chargeback process?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'm seeking a full refund for the disputed transaction.I have attached my credit card statement for reference.\",\n        linkedDocuments: {\n          \"Credit Card Transactions\",\n          \"Duplicate Transaction Bank Statement\"\n        }\n      )\n    }\n  ),\n  /*Merchant Dispute Challenge*/\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Merchant Dispute Challenge\",\n    parentComment: a!map(\n      commentText: \"I have reviewed the documentation provided by the cardholder regarding the disputed transaction with Merchant. The transaction appears to be valid based on the merchant's terms of service. We may need to challenge this dispute.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Thank you for your assessment, Could you please summarize the key points from the documentation? This will help us prepare our response to the cardholder.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Sure. The documentation includes the invoice for the transaction, which shows that the goods were delivered as per the agreement.\",\n        linkedDocuments: {\n          \"Restaurant Bill\",\n          \"Duplicate Transaction Receipts\"\n        }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Merchant Dispute Challenge\",\n    parentComment: a!map(\n      commentText: \"I've reviewed the correspondence between the cardholder and Merchant regarding the disputed charge. It seems there was an attempt to resolve the issue before the chargeback was initiated. Should we request more information from the merchant?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"That sounds relevant. Please gather any additional communication that can support our case. It's crucial to have a comprehensive understanding before proceeding.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Merchant Dispute Challenge\",\n    parentComment: a!map(\n      commentText: \"Let's gather all pertinent information to present a strong case in favor of the merchant. This includes any emails, shipment tracking details, or refund attempts documented.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {}\n  ),\n  /*Re-evaluate Dispute*/\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Re-evaluate Dispute\",\n    parentComment: a!map(\n      commentText: \"I have completed the initial review of the dispute case. The transaction dates align with the cardholder's statement, but I need further verification from our fraud team.\",\n      linkedDocuments: {\n        \"Credit Card Transactions\",\n        \"Duplicate Transaction Bank Statement\"\n      },\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Thank you for the update.Could you provide more details on the specific transactions in question? This will help us determine the next steps for re-evaluation.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Re-evaluate Dispute\",\n    parentComment: a!map(\n      commentText: \"I've received updated information from the merchant regarding the disputed transaction. They have provided proof of delivery and claim the transaction was authorized. How should we proceed?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Please forward me the documentation from the merchant. I'll review it alongside our existing records and consult with our team to reassess the dispute\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Re-evaluate Dispute\",\n    parentComment: a!map(\n      commentText: \"Let's gather all relevant information and prepare a comprehensive report.We may need to request further details from the cardholder to clarify any discrepancies.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Here is the final report that has been created.\",\n        linkedDocuments: {\n          \"Duplicate Transaction - Reevalutaion Report\",\n          \"Incorrect Amount Charged - Reevalutaion Report\"\n        }\n      )\n    }\n  ),\n  /*Issuer Decision*/\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Issuer Decision\",\n    parentComment: a!map(\n      commentText: \"I have completed the investigation into Cardholder's dispute. Based on our findings and the provided evidence, I recommend issuing a decision  in favor of the cardholder.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Thank you for your thorough review. Could you please outline the steps taken during the investigation and the rationale behind your recommendation? This will help us document the decision properly.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Sure. During the investigation, we reviewed transaction logs, communicated with the cardholder and merchant, and verified the cardholder's claim of unauthorized use. The evidence supports a decision in favor of the cardholder due to lack of authorization.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Issuer Decision\",\n    parentComment: a!map(\n      commentText: \"I've received additional documentation from the merchant disputing the cardholder's claim of non-receipt of goods. They provided shipment tracking and delivery confirmation. How should we proceed with this new information?\",\n      linkedDocuments: {\n        \"Receipt\",\n        \"Duplicate Transaction Receipts\"\n      },\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Please forward me the documentation from the merchant.Thank you for bringing this to our attention. Let's carefully analyze the new information and determine if it impacts our initial decision.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Issuer Decision\",\n    parentComment: a!map(\n      commentText: \"Lets mark the case as arbitrate case\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {}\n  ),\n  /*Arbitrate Case*/\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Arbitrate Case\",\n    parentComment: a!map(\n      commentText: \"I have escalated Cardholder's dispute to arbitration due to the complexity and conflicting evidence provided by both parties. We need to prepare a comprehensive case file for submission to the arbitration panel.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Thank you for initiating the arbitration process. Could you outline the main points of contention and the evidence presented by both the cardholder and the merchant? This will help us prepare a strong case.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Sure,I'll compile a detailed case file.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Arbitrate Case\",\n    parentComment: a!map(\n      commentText: \"I've reviewed the initial findings and evidence provided by both parties. It appears there are discrepancies in the timelines and communication records. How should we address these during arbitration?\",\n      linkedDocuments: {\n        \"Payment Authorization\",\n        \"Duplicate Transaction Bank Statement\"\n      },\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Please document the discrepancies and gather additional information to clarify the timeline and communication issues. We'll need to present a clear and coherent narrative to the arbitration panel.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Arbitrator Decision*/\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Arbitrator Decision\",\n    parentComment: a!map(\n      commentText: \"I have reviewed the arbitration case involving Cardholder and Merchant.We need reeevaluation report before making any decision.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Please find the requested documents\",\n        linkedDocuments: {\n          \"Duplicate Transaction - Reevalutaion Report\",\n          \"Incorrect Amount Charged - Reevalutaion Report\"\n        }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Credit Card Disputes (DEMO)\",\n    taskTitle: \"Arbitrator Decision\",\n    parentComment: a!map(\n      commentText: \"Could we please get the timeline of events leading to the dispute.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"How should we outline this in our final submission?\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Please compile a timeline that includes key events such as transaction dates, communication between the parties, and any dispute resolution attempts.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Automated Clearing House*/\n  /*Intake Review*/\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Intake Review\",\n    parentComment: a!map(\n      commentText: \"Could you please provide a copy of the bank statement showing the disputed transaction? This will help us initiate the intake review process and gather necessary details.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll retrieve the latest bank statement from our records and highlight the disputed transaction for your review.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Having the bank statement will enable us to accurately document the disputed amount and transaction details for the intake review.\",\n        linkedDocuments: { \"Bank Statement\", \"Transaction History\" }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Intake Review\",\n    parentComment: a!map(\n      commentText: \"Can you confirm the date and amount of the disputed transaction?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Yes, the disputed transaction occurred on last Thursday\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Dispute Validity*/\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Dispute Validity\",\n    parentComment: a!map(\n      commentText: \"Could you please provide the contract or agreement related to the disputed transaction? This document is crucial for assessing the validity of the dispute.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll search our records for the contract or agreement pertaining to the disputed transaction. Once located, I'll provide you with a copy for review.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Having the contract or agreement will help us understand the terms and conditions agreed upon by both parties. It's essential for resolving the dispute.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Dispute Validity\",\n    parentComment: a!map(\n      commentText: \"I have reviewed the ACH dispute initiated by Customer.The customer claims they did not authorize this transaction.We need to validate the dispute and gather supporting evidence.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Thank you for initiating the review. Can you provide details on the transaction amount, date, and any other pertinent information? This will help us determine the next steps\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Here is the evidence submited by the customer\",\n        linkedDocuments: {\n          \"Transaction Error Screenshot From Mobile\",\n          \"Payment Not Received Business Account Statement\"\n        }\n      )\n    }\n  ),\n  /*ACH Network Validity*/\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"ACH Network Validity\",\n    parentComment: a!map(\n      commentText: \"Was the transaction authorized by the account holder? If so, can you provide documentation or proof of authorization?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"According to the account holder, they did not authorize this transaction. They have not provided authorization documentation to the contrary.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Have you spoken with the account holder regarding the disputed transaction? What was their response?\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"ACH Network Validity\",\n    parentComment: a!map(\n      commentText: \"What documentation has the bank provided regarding the disputed transaction? How does it support their position?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"The bank has provided documentation showing that the transaction was processed with an authorization code and matches the account holder's identity details.\",\n        linkedDocuments: { \"Transaction History\", \"Bank Statement\" }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"ACH Network Validity\",\n    parentComment: a!map(\n      commentText: \"Has there been any attempt by the account holder to resolve the dispute directly with the merchant or through the bank? What was the outcome?\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"The account holder contacted the bank immediately upon noticing the unauthorized transaction and initiated a dispute process. The bank informed them they would investigate further.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Inform ACH Network*/\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Inform ACH Network\",\n    parentComment: a!map(\n      commentText: \"This task can be marked as not needed as it is completed along with while validation\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {}\n  ),\n  /*Dispute Ongoing?*/\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Dispute Ongoing?\",\n    parentComment: a!map(\n      commentText: \"Can you provide an overview of the current status of the dispute? Have we received any new information or responses from the bank or customer?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"The dispute remains ongoing. We have received additional documentation from the bank showing the transaction was processed with an authorization code. Customer maintains they did not authorize this transaction and are awaiting further investigation.\",\n        linkedDocuments: { \"Transaction History\", \"Bank Statement\" }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Dispute Ongoing?\",\n    parentComment: a!map(\n      commentText: \"I've communicated with Customer regarding the ongoing dispute. They are concerned about the timeline for resolution and any updates on the progress. How should we address their inquiries?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Please reassure Customer that we are actively investigating the dispute and will provide updates as soon as we have new information. It's important to keep them informed throughout the process.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Merchant Dispute Challenge*/\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Merchant Dispute Challenge\",\n    parentComment: a!map(\n      commentText: \"I have initiated a Merchant Dispute Challenge task for the ACH debit dispute involving Merchant. Customer claims the transaction was unauthorized, and we need to challenge the merchant's position.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Could you provide details on the specific grounds for challenging the merchant's position? This will help us formulate our response.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"They have provided documentation supporting their assertion, including communication with the merchant requesting a refund.\",\n        linkedDocuments: {\n          \"Payment Not Received Letter\",\n          \"Cardholder Transaction Dispute Form\"\n        }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Merchant Dispute Challenge\",\n    parentComment: a!map(\n      commentText: \"I've reviewed the initial response from Merchant disputing Customer's claim. They assert the transaction was authorized and have provided transaction details. How should we proceed?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Please forward me the documentation from Merchant.I will review it alongside our investigation findings and consult with our team to prepare a rebuttal. It's crucial to address all points raised by the merchant.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"We may need to request additional evidence from Customer to strengthen our position.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Re-evaluate Dispute*/\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Re-evaluate Dispute\",\n    parentComment: a!map(\n      commentText: \"Could you provide a summary of the initial findings and any specific reasons prompting the reevaluation? This will help us focus our review.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"We reviewed transaction records and customer communications. Now, new documentation has surfaced suggesting the transaction may have been authorized after all.\",\n        linkedDocuments: { \"Authorization Form\", \"Invoice\" }\n      ),\n      a!map(\n        commentText: \"I'm planning to conduct additional interviews with Customer regarding their claim\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Re-evaluate Dispute\",\n    parentComment: a!map(\n      commentText: \"The customers are concerned about the progress of the dispute. How should we address their concerns?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Thank you for the update. Please assure Customer that we are conducting a thorough reevaluation of the dispute. We will update them as soon as we have completed the review and reached a decision.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Let's also inform Customer that we take their concerns seriously and are committed to resolving the issue fairly. We appreciate their patience as we work through this process.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*ACH Dispute Decision*/\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"ACH Dispute Decision\",\n    parentComment: a!map(\n      commentText: \"I have completed the investigation into Customer's ACH dispute regarding an unauthorized debit from their account. Based on our findings and the provided evidence, I recommend issuing a decision in favor of the customer.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Can you outline the steps taken during the investigation and the rationale behind your recommendation? This will help us document the decision properly.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"During the investigation, we reviewed transaction logs, communicated with the customer and bank, and verified the customer's claim of unauthorized use. The evidence supports a decision in favor of the customer due to lack of authorization.\",\n        linkedDocuments: { \"Transaction History\", \"Bank Statement\" }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"ACH Dispute Decision\",\n    parentComment: a!map(\n      commentText: \"Based on the evidence reviewed, what is your recommendation for the dispute decision?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Considering the account holder's consistent claim of unauthorized use, lack of authorization documentation, and unsuccessful attempts to resolve the issue with the merchant, I recommend issuing a decision in favor of the account holder.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Is there any additional evidence or information that could supoort your decision\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Customer Wins Dispute*/\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Customer Wins Dispute\",\n    parentComment: a!map(\n      commentText: \"I've reviewed the findings and documentation provided. Customer has been notified of the ruling in their favor and is requesting information on the next steps. How should we proceed?\",\n      linkedDocuments: {\n        \"ACH Transaction Error - Reevalutaion Report\",\n        \"ACH Payment Not Received - Reevalutaion Report\"\n      },\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Please inform Customer that we will work with the bank to ensure the transaction is reversed promptly and any associated fees are refunded.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Customer Wins Dispute\",\n    parentComment: a!map(\n      commentText: \"Let's also provide Customer with a timeline for when they can expect the resolution of this issue. It's important to reassure them that we are committed to resolving the matter promptly.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Sure.I will notify the customer about it.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Merchant Wins Dispute*/\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Merchant Wins Dispute\",\n    parentComment: a!map(\n      commentText: \"I've reviewed the findings and documentation provided by Merchant . Customer has been notified of the ruling in favor of the merchant and is requesting information on appealing the decision. How should we respond?\",\n      linkedDocuments: {\n        \"ACH Transaction Error - Reevalutaion Report\",\n        \"ACH Payment Not Received - Reevalutaion Report\"\n      },\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Please inform Customer the reasons for the decision and provide them with information on their appeal rights if they wish to pursue further action.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Automated Clearing House (DEMO)\",\n    taskTitle: \"Merchant Wins Dispute\",\n    parentComment: a!map(\n      commentText: \"Let's also reassure Customer  that we understand their concerns and are available to discuss any questions they may have about the ruling. It's important to maintain transparency and address their inquiries promptly.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Sure.I will notify the customer about it.\",\n        linkedDocuments: null\n      )\n    }\n  )\n}",
  "calls": [],
  "called_by": []
}