{
  "uuid": "_a-0000ec0f-47ad-8000-9ba8-011c48011c48_14041",
  "name": "CMGT_EXT_DATA_ResidentialPermit_Comments",
  "type": "Expression Rule",
  "description": "Rule for creating ResidentialPermit comments",
  "sail_code": "{\n  /*Case Comments*/\n  /*Urban Oasis Residence*/\n  a!map(\n    caseTitle: \"Urban Oasis Residence\",\n    parentComment: a!map(\n      commentText: \"The design of the Urban Oasis Residence is stunning! It seamlessly blends modern architecture with a touch of nature\",\n      linkedDocuments: \"Building Plans for Residential Permit\",\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Absolutely! I love how they've incorporated green spaces into the design. It adds a refreshing touch to urban living.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Are there any public amenities planned within the residence? Parks, communal spaces, etc.?\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Urban Oasis Residence\",\n    parentComment: a!map(\n      commentText: \"I'm concerned about the traffic impact this new residence might have on the surrounding area. Has a traffic study been conducted?\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Good point. Traffic management is crucial. I hope the city planners have considered the implications.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Yes it has been considered.Here is the Impact Assessment report \",\n        linkedDocuments: \"Environmental Impact Assessment for Residential Permit\"\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Urban Oasis Residence\",\n    parentComment: a!map(\n      commentText: \"Does the homeowner have any plans to incorporate energy-efficient or smart home features in the interior renovations? It could add a modern touch to the urban oasis.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Including smart home technology or energy-efficient appliances could align the project with contemporary living standards and sustainability.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Urban Oasis Residence\",\n    parentComment: a!map(\n      commentText: \"Are there any community engagement plans? It might be beneficial for the homeowner to share their vision with neighbors and gather feedback or suggestions for the project.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: a!map(\n      commentText: \"Involving the community in the planning process can foster positive relationships and address any concerns or suggestions raised by neighbors.\",\n      linkedDocuments: null\n    )\n  ),\n  a!map(\n    caseTitle: \"Urban Oasis Residence\",\n    parentComment: a!map(\n      commentText: \"What measures is the homeowner taking to ensure the project aligns with the overall urban aesthetic? Ensuring coherence with the surrounding environment is crucial.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: a!map(\n      commentText: \"Perhaps they could choose design elements that complement the existing urban landscape and contribute positively to the neighborhood's visual appeal.\",\n      linkedDocuments: \"Property Survey for Residential Permit\"\n    )\n  ),\n  /*Downtown Retreat Renovation*/\n  a!map(\n    caseTitle: \"Downtown Retreat Renovation\",\n    parentComment: a!map(\n      commentText: \"The renovation plans for Downtown Retreat look ambitious! Can't wait to see the final result.\",\n      linkedDocuments: \"The Downtown Retreat Renovation Journey\",\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Absolutely! The balance between preserving the historic charm and bringing in modern amenities is spot on.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"I'm curious about the timeline for Downtown Retreat. Any updates on when they expect to finish?\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Downtown Retreat Renovation\",\n    parentComment: a!map(\n      commentText: \"What do you think about the color scheme they're proposing for Downtown Retreat? I'm still not sure about the accent colors.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I agree, the accent colors are bold. But I think once everything comes together, it'll complement the overall vibe they're going for.\",\n        linkedDocuments: \"Techniques for Revitalizing Downtown Retreats\"\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Downtown Retreat Renovation\",\n    parentComment: a!map(\n      commentText: \"Do you think the community will embrace the changes at Downtown Retreat?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: a!map(\n      commentText: \"I think so. They've been consulting with local groups to ensure it remains a beloved spot while updating it for future generations.\",\n      linkedDocuments: null\n    )\n  ),\n  a!map(\n    caseTitle: \"Downtown Retreat Renovation\",\n    parentComment: a!map(\n      commentText: \"I heard they're incorporating sustainable practices into the renovation at Downtown Retreat. That's fantastic!\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: a!map(\n      commentText: \"Absolutely! It's great to see them prioritize sustainability. It'll set a positive example for other projects in the area.\",\n      linkedDocuments: null\n    )\n  ),\n  /*Commercial Solar Farm Approval*/\n  a!map(\n    caseTitle: \"Commercial Solar Farm Approval\",\n    parentComment: a!map(\n      commentText: \"I'm curious about the economic benefits for the local community. Will the solar farm project create job opportunities or have positive impacts on the local economy?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"It would be great if they engage in local hiring and perhaps invest in community projects as part of their corporate social responsibility.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Yes I agree. We can plan for it\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Commercial Solar Farm Approval\",\n    parentComment: a!map(\n      commentText: \"How does the company plan to handle any potential disruption to local wildlife habitats? Are there measures in place to protect and preserve the natural environment?\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: a!map(\n      commentText: \"It would be reassuring to know if they're consulting with environmental experts to ensure minimal impact on wildlife during and after construction.\",\n      linkedDocuments: \"Environmental Impact Assessment for Permit Solar\"\n    )\n  ),\n  a!map(\n    caseTitle: \"Commercial Solar Farm Approval\",\n    parentComment: a!map(\n      commentText: \"Are there any community outreach programs planned to keep the local residents informed and address any concerns they might have about the solar farm project?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: a!map(\n      commentText: \"Effective communication with the community is key. They should conduct town hall meetings or workshops to address queries and build support for the project.\",\n      linkedDocuments: \"Community Outreach Document for Permit Solar\"\n    )\n  ),\n  /*Solar Expansion in Residential Areas*/\n  a!map(\n    caseTitle: \"Solar Expansion in Residential Areas\",\n    parentComment: a!map(\n      commentText: \"The solar expansion in residential areas is really gaining momentum. It's great to see more homeowners embracing renewable energy.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Definitely! The incentives and lower costs of solar panels are making it more accessible for families to go green.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Agreed! It's not just about savings; it's about reducing our carbon footprint. Every home that goes solar contributes to a cleaner environment.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Solar Expansion in Residential Areas\",\n    parentComment: a!map(\n      commentText: \"I'm curious about the regulatory hurdles for installing solar panels in our region. Have they eased up recently?\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"They have! Local governments have been streamlining the permit process and offering more support for residential solar installations.\",\n        linkedDocuments: \"Guidance for Residential Solar Permit\"\n      ),\n      a!map(\n        commentText: \"That's encouraging news! It should encourage even more homeowners to consider making the switch to solar.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseTitle: \"Solar Expansion in Residential Areas\",\n    parentComment: a!map(\n      commentText: \"What are your thoughts on the aesthetic impact of solar panels in residential neighborhoods?.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"It's a valid concern. Thankfully, there are more aesthetically pleasing options now, like integrated solar tiles and sleek designs.\",\n        linkedDocuments: \"Structural Criteria for Solar Permit\"\n      ),\n      a!map(\n        commentText: \"True, and as more people install them, they become a common sight. The benefits far outweigh any minor aesthetic concerns.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Addition Permi*/\n  /*Intake Review*/\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Intake Review\",\n    parentComment: a!map(\n      commentText: \"Could you please provide the latest site plan and elevation drawings? It would help us assess the proposed changes accurately\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Sure, I'll gather the documents and send them over to you by the end of today.\",\n        linkedDocuments: {\n          \"Site Plan\",\n          \"Building Plans for Residential Permit\"\n        }\n      ),\n      a!map(\n        commentText: \"I've seen the preliminary drawings; they seem promising. Once we have the updated documents, we can proceed with the review.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Intake Review\",\n    parentComment: a!map(\n      commentText: \"Are there any outstanding permits or approvals required for the project? We need to ensure all regulatory aspects are in order.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll review the checklist to confirm if there are any pending permits or approvals. If so, we'll expedite the process to prevent delays.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Intake Review\",\n    parentComment: a!map(\n      commentText: \"There were discussions about additional environmental permits. Let's verify their status and ensure compliance before moving forward.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {}\n  ),\n  /*Ready for SME Review?*/\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Ready for SME Review?\",\n    parentComment: a!map(\n      commentText: \"Is the technical specification document ready for SME review? We need to ensure all details are accurate before proceeding.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'm finalizing the technical specs today. I'll send them over for your review by the end of the day.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"The initial draft looks good. Once we have the final version, we can schedule the SME review to iron out any technical details.\",\n        linkedDocuments: {\n          \"Property Survey for Residential Permit\",\n          \"Techniques for Revitalizing Downtown Retreats\"\n        }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Ready for SME Review?\",\n    parentComment: a!map(\n      commentText: \"Could you provide the project timeline and milestones document for the SME review? It's crucial to align expectations and deadlines.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll update the timeline document with the latest milestones and share it with you by tomorrow morning.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"The milestones are critical for the SMEs to understand the project scope. We'll ensure they have all necessary information for a thorough review.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Ready for SME Review?\",\n    parentComment: a!map(\n      commentText: \"Has the budget proposal been finalized for the SME review? We need to ensure financial feasibility before proceeding with approvals.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'm reviewing the budget proposal with finance today\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Planning Review*/\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Planning Review\",\n    parentComment: a!map(\n      commentText: \"Could you please provide the updated site plan and landscaping details for the planning review in the residential permit case? These documents are crucial for assessing compliance with zoning regulations.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Sure, I'll gather the latest site plan and landscaping details from the architect. Expect them in your inbox by the end of the day.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"The previous site plan showed some adjustments were needed. Once we receive the updated documents, we can proceed with the review.\",\n        linkedDocuments: {\n          \"Site Plan\",\n          \"Building Plans for Residential Permit\"\n        }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Planning Review\",\n    parentComment: a!map(\n      commentText: \"Has the traffic impact study been completed for the residential permit case? We need to evaluate potential impacts on local roads and traffic flow.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"The traffic study report is currently being finalized by our consultants. I'll request an expedited update and share it with you as soon as it's available.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Traffic flow around the area was a concern raised in previous meetings. Once we have the finalized study, we can address any necessary mitigation measures.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Planning Review\",\n    parentComment: a!map(\n      commentText: \"Follow-up with the customer required.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Will follow up.I'll update the status within end of the day today\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Environmental Review*/\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Environmental Review\",\n    parentComment: a!map(\n      commentText: \"Could you please provide the environmental impact assessment report for the residential permit case? We need to evaluate the project's impact on local ecosystems.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll ensure the environmental impact assessment report is retrieved from our consultants today. Expect it in your inbox by tomorrow morning.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"The initial findings highlighted potential concerns with nearby wetlands. Once we have the detailed report, we can devise appropriate mitigation strategies.\",\n        linkedDocuments: {\n          \"Environmental Impact Assessment for Residential Permit\",\n          \"Revamping a Downtown Retreat for Contemporary Living\"\n        }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Environmental Review\",\n    parentComment: a!map(\n      commentText: \"Has the soil contamination assessment been conducted for the residential permit case? We need to ensure the site is safe for construction.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"The soil assessment was scheduled for last week. I'll follow up with the environmental team and provide you with the findings and recommendations.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Soil quality has been a recurring issue in this area. Once we have the assessment results, we can address any remediation required.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Environmental Review\",\n    parentComment: a!map(\n      commentText: \"Are there any permits or approvals from the Department of Natural Resources required for the environmental review in the residential permit case? We need to ensure full compliance.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll review the checklist to confirm if there are any pending permits from the Department of Natural Resources. If needed, I'll initiate the application process promptly.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"The last update indicated potential requirements for a water usage permit. Let's verify and ensure everything is in order to avoid delays.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Building Review*/\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Building Review\",\n    parentComment: a!map(\n      commentText: \"Could you please provide the updated building plans and structural drawings for the building review in the residential permit case? These documents are crucial for assessing compliance with building codes.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll gather the latest building plans and structural drawings from the architect. You can expect them in your inbox by the end of the day.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"The previous plans showed some discrepancies in load-bearing calculations. Once we receive the updated documents, we can proceed with the review.\",\n        linkedDocuments: {\n          \"Building Plans for Residential Permit\",\n          \"Site Plan\"\n        }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Building Review\",\n    parentComment: a!map(\n      commentText: \"Are there any energy efficiency reports or certifications required for the building review in the residential permit case? We need to verify compliance with green building standards.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll check the checklist to confirm if there are any pending energy efficiency reports. If necessary, I'll coordinate with the energy consultant to expedite the process.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Energy efficiency has been a priority in recent developments. Let's ensure all certifications are in place to showcase our commitment to sustainable building practices.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Building Review\",\n    parentComment: a!map(\n      commentText: \"Has the fire safety plan been finalized for the residential permit case? We need to ensure the safety measures meet local regulations.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"The fire safety plan is in its final stages of review. I'll ensure you receive the approved version along with any necessary documentation by tomorrow.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Fire safety was a key concern raised during the initial assessment. Once we have the finalized plan, we can address any additional safety measures required.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Electrical & Plumbing Review*/\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Electrical & Plumbing Review\",\n    parentComment: a!map(\n      commentText: \"Has the energy audit report been finalized for the residential permit case? We need to assess energy consumption and efficiency measures.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"The energy audit report is undergoing final review by our energy consultant. I'll ensure you receive the approved version along with any necessary documentation by tomorrow.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Energy efficiency is critical in residential projects. Once we have the audit report, we can implement any recommended improvements.\",\n        linkedDocuments: {\n          \"Environmental Impact Assessment for Residential Permit\",\n          \"Renovating a Downtown Retreat for Urban Living\"\n        }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Electrical & Plumbing Review\",\n    parentComment: a!map(\n      commentText: \"Are there any plumbing fixture specifications and electrical load calculations available for the residential permit case? We need to verify compliance with building codes.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll review the project files to gather the plumbing fixture specifications and electrical load calculations. If any documents are missing, I'll request them promptly.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Plumbing fixture placement was a concern in the initial assessment. Let's ensure all specifications are documented and meet regulatory standards.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Payment Made*/\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Payment Made\",\n    parentComment: a!map(\n      commentText: \"Are there any outstanding fees or charges associated with the residential permit case? We need to ensure all financial obligations are met before proceeding.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll conduct a thorough review of the financial records to confirm if there are any outstanding fees. If so, we'll address them promptly.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Payment Made\",\n    parentComment: a!map(\n      commentText: \"Has the final invoice for the residential permit case been issued? We need to reconcile the payments made against the total project cost.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"The final invoice was generated last week. I'll forward you the invoice details and confirmation of payments received for your records.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Payment Made\",\n    parentComment: a!map(\n      commentText: \"Could you please provide the payment receipt and confirmation for the permit case? We need to ensure all fees are processed and documented.\",\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll retrieve the payment receipt from our financial records and send you a copy along with the confirmation of payment by the end of today.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"The payment has been verified.We can update the status and proceed with the permit issuance.\",\n        linkedDocuments: {\n          \"Financial Statement For Urban Oasis\",\n          \"Financial Statement of Downtown retreat\"\n        }\n      )\n    }\n  ),\n  /*Permit Issuance*/\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Permit Issuance\",\n    parentComment: a!map(\n      commentText: \"Has the zoning approval been obtained for the permit case? We need to ensure compliance with local zoning regulations before issuing the permit.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Zoning approval was granted last week. I'll forward you the approval letter and any related documents to include in the permit issuance package.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Zoning restrictions were a key consideration in this area. Now that we have approval, we can move forward with the permit issuance without delays.\",\n        linkedDocuments: \"Zoning Approval Document\"\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Permit Issuance\",\n    parentComment: a!map(\n      commentText: \"Are there any outstanding inspections or reviews required for the residential permit case before issuance? We need to verify completion of all necessary procedures.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll review the checklist to confirm if all inspections and reviews have been completed. If any are outstanding, I'll coordinate with the inspection team to expedite.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Inspections have been scheduled according to the project timeline. Once we have their final reports, we can proceed confidently with the permit issuance.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Permit Issuance\",\n    parentComment: a!map(\n      commentText: \"Inspections have been scheduled according to the project timeline. Once we have their final reports, we can proceed confidently with the permit issuance.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {}\n  ),\n  /*Foundation Inspection*/\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Foundation Inspection\",\n    parentComment: a!map(\n      commentText: \"Could you please provide the preliminary foundation plans and soil analysis report for the residential permit case? These documents are crucial for scheduling the foundation inspection.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll ensure the preliminary foundation plans and soil analysis report are retrieved from our records department. Expect them in your inbox by tomorrow.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"The previous soil analysis hinted at potential concerns with ground stability. Once we receive the updated report, we can proceed with the inspection.\",\n        linkedDocuments: \"Foundation Report\"\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Foundation Inspection\",\n    parentComment: a!map(\n      commentText: \"Has the as-built foundation drawings been finalized for the residential permit case? We need them for the foundation inspection.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"The as-built foundation drawings are undergoing final review by our engineering team. I'll expedite the process and send you the approved version as soon as possible.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Foundation Inspection\",\n    parentComment: a!map(\n      commentText: \"Are there any geotechnical reports or recommendations available for the foundation inspection in the residential permit case? We need to verify compliance with soil conditions.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {}\n  ),\n  /*Building Inspection*/\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Building Inspection\",\n    parentComment: a!map(\n      commentText: \"Could you please provide the building plans and specifications for the residential permit case? These documents are necessary for scheduling the building inspection.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll gather the updated building plans and specifications from our records department. You can expect them in your inbox by tomorrow.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"The previous plans had some discrepancies in structural details. Once we receive the updated documents, we can proceed with scheduling the inspection.\",\n        linkedDocuments: {\n          \"Building Plans for Residential Permit\",\n          \"Site Plan\"\n        }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Addition Permit (DEMO)\",\n    taskTitle: \"Building Inspection\",\n    parentComment: a!map(\n      commentText: \"Has the as-built foundation drawings been finalized for the residential permit case? We need them for the foundation inspection.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"The as-built foundation drawings are undergoing final review by our engineering team. I'll expedite the process and send you the approved version as soon as possible.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Solar Permit*/\n  /*Intake Review*/\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Intake Review\",\n    parentComment: a!map(\n      commentText: \"I noticed that the site plan for the new solar permit application doesn't clearly show the distance from the solar panels to the property line. We might need to ask for a revised plan.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Good catch, That's an important detail for zoning compliance. I'll draft an email to request the updated site plan.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Here is the updated site plan\",\n        linkedDocuments: {\n          \"Site Plan for Commercial Solar Farm Approval\",\n          \"Site Plan for Solar Expansion in Residential Areas\"\n        }\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Intake Review\",\n    parentComment: a!map(\n      commentText: \"We should consider the note about potential shading issues from nearby trees? It looks like it could impact the efficiency of the solar panels.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I think we should ask the applicant to provide a shading analysis. It would help us better understand the potential impact.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Intake Review\",\n    parentComment: a!map(\n      commentText: \"I noticed that the application is missing the manufacturer's spec sheets for the inverters. We need those to verify compliance with the electrical code.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I\" & fn!char(8217) & \"ll send an email to the customer about it\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"I\" & fn!char(8217) & \"ll take care of updating the system notes to reflect these pending items. Once we have all the documents, we can proceed with the technical review.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Ready for SME Review?*/\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Ready for SME Review?\",\n    parentComment: a!map(\n      commentText: \"I just finished reviewing the solar permit application. There\" & fn!char(8217) & \"s a note about using a different type of inverter than the one specified in the initial application. Should we flag this?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Any deviation from the approved equipment needs to be thoroughly reviewed. I'll add it to the list of items to check.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Ready for SME Review?\",\n    parentComment: a!map(\n      commentText: \"I notice the discrepancy in the energy production estimates? The initial application mentioned 60 kW, but the updated documents estimate only 50 kW.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Yes, I saw that too. It\" & fn!char(8217) & \"s important for the us to evaluate this change, as it could affect the project\" & fn!char(8217) & \"s compliance with the expected energy output.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Yes I have attached the document that is shared by the customer\",\n        linkedDocuments: {\n          \"Guidance for Residential Solar Permit\",\n          \"Technical Specifications for Permit Solar\"\n        }\n      )\n    }\n  ),\n  /*Planning Review*/\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Planning Review\",\n    parentComment: a!map(\n      commentText: \"I noticed that the proposed location for the solar panels is very close to the neighboring property. We might need to check the setback requirements to ensure compliance with zoning regulations.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll pull up the zoning code to confirm the setback requirements. If it doesn't meet the standards, we'll need to ask the applicant to adjust the site plan.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Planning Review\",\n    parentComment: a!map(\n      commentText: \"I see that the project plans to use a large battery storage system. Do we need to verify if additional fire safety measures are required?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"That's a good point. Battery storage systems often have specific fire safety requirements. We should consult with the fire department to see if they need to review the plans.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Yes I'll make necessary arrangements\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Planning Review\",\n    parentComment: a!map(\n      commentText: \"The document mentions future expansion of the solar system? Should we plan for potential impacts now, or wait until they submit a formal expansion proposal?\",\n      linkedDocuments: {\n        \"Structural Criteria for Solar Permit\",\n        \"Permit Applications for Solar Permit\"\n      },\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"It's probably best to address potential impacts now. I\" & fn!char(8217) & \"ll add a note to our planning document to consider the expansion in our review, so we don't overlook any long-term issues.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Environmental Review*/\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Environmental Review\",\n    parentComment: a!map(\n      commentText: \"I noticed that the proposed site for the solar panels is near a wetland area. We need to check if there are any specific regulations or restrictions for building close to wetlands.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Good observation. Wetlands often have stringent protection rules. I\" & fn!char(8217) & \"ll look into the local environmental regulations to see what restrictions might apply.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Environmental Review\",\n    parentComment: a!map(\n      commentText: \"The environmental impact report mentions the presence of a protected bird species in the vicinity. Should we request a detailed wildlife assessment to understand the potential impacts?\",\n      linkedDocuments: \"Environmental Impact Assessment for Permit Solar\",\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Definitely. We need to ensure the project won\" & fn!char(8217) & \"t harm local wildlife. I\" & fn!char(8217) & \"ll draft a request for a comprehensive wildlife assessment from the applicant.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"The soil analysis report indicates a risk of erosion due to the slope of the land. Should we ask the applicant to provide an erosion control plan?\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Environmental Review\",\n    parentComment: a!map(\n      commentText: \"The application includes plans for tree removal. Should we require a reforestation plan or some form of mitigation for the loss of trees?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Absolutely. Tree removal can have a big environmental impact. I\" & fn!char(8217) & \"ll add a note to request a reforestation plan or other mitigation measures to offset the loss of trees.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Let\" & fn!char(8217) & \"s make sure we cover all these environmental concerns before moving forward.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Electrical & Plumbing Review*/\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Electrical & Plumbing Review\",\n    parentComment: a!map(\n      commentText: \"I noticed that the electrical layout for the solar panels shows the inverter being installed in a basement room. We need to verify if the ventilation in that room meets the required standards.\",\n      linkedDocuments: {\n        \"Electrical layout for Commercial Solar Farm Approval\",\n        \"Electrical layout for Solar Expansion in Residential Areas\"\n      },\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Good point. Inverters can generate a lot of heat, and proper ventilation is crucial. I'll add a note to check the ventilation requirements and ask the applicant for more details if needed.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Electrical & Plumbing Review\",\n    parentComment: a!map(\n      commentText: \"The plans show that the solar system will be connected to the existing electrical panel, which is already quite old. Should we require an inspection of the panel to ensure it can handle the additional load?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"An overloaded panel can be a safety hazard. I'll request a detailed inspection report of the existing panel from a certified electrician.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"The plumbing plans include a rainwater harvesting system connected to the solar panel setup. We need to ensure that the plumbing complies with local codes for non-potable water systems.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Electrical & Plumbing Review\",\n    parentComment: a!map(\n      commentText: \"The application mentions the use of conduit runs for the electrical wiring, but it doesn't specify if they are above ground or underground. Should we clarify this with the applicant?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Absolutely. The type of conduit run can affect both safety and compliance. I'll draft an email to the applicant asking for clarification on the conduit runs.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Perfect. I'll handle the ventilation and plumbing code checks, and you can take care of the inspection report and conduit clarification.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Payment Made*/\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Payment Made\",\n    parentComment: a!map(\n      commentText: \"I noticed that the payment record for the solar permit application shows a discrepancy. The amount paid doesn\" & fn!char(8217) & \"t match the fee schedule. We need to verify if they\" & fn!char(8217) & \"ve underpaid or overpaid.\",\n      linkedDocuments: {\n        \"Financial Statement\",\n        \"Financial Statement for Commercial Solar Farm Approval\"\n      },\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll cross-check the fee schedule with the payment record to see where the discrepancy lies. If there\" & fn!char(8217) & \"s an issue, we\" & fn!char(8217) & \"ll need to notify the applicant.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Payment Made\",\n    parentComment: a!map(\n      commentText: \"The receipt number for the payment is missing from our system. Should we request the applicant to provide a copy of the receipt for our records?\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Yes, we should. The receipt is important for our audit trail. I\" & fn!char(8217) & \"ll draft an email requesting the receipt from the applicant.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Let\" & fn!char(8217) & \"s get these payment issues resolved quickly\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Permit Issuance*/\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Permit Issuance\",\n    parentComment: a!map(\n      commentText: \"The applicant has requested an expedited permit issuance due to a time-sensitive project deadline. Do you think we can prioritize this?\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"Given the circumstances, we should try to accommodate their request. I\" & fn!char(8217) & \"ll check with our supervisor to see if we can expedite the process once all documents are in order.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Permit Issuance\",\n    parentComment: a!map(\n      commentText: \"The environmental compliance certificate is set to expire next month. Should we notify the applicant to renew it, or is it okay for the current issuance?\",\n      linkedDocuments: \"Environmental Impact Assessment for Permit Solar\",\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"We should definitely notify the applicant to renew it. The certificate needs to be valid at the time of issuance to avoid any compliance issues later.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Let\" & fn!char(8217) & \"s ensure we have everything in place before issuing the permit.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  /*Electrical Inspection*/\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Electrical Inspection\",\n    parentComment: a!map(\n      commentText: \"Are there any certificates or permits for electrical installations available for the residential permit case? We need to verify compliance with electrical safety standards.\",\n      linkedDocuments: null,\n      isBookmarked: true\n    ),\n    childComments: {\n      a!map(\n        commentText: \"I'll review the project file for any certificates or permits related to electrical installations. If they're not readily available, I'll coordinate with the electrician to provide them promptly.\",\n        linkedDocuments: null\n      ),\n      a!map(\n        commentText: \"Electrical safety is paramount. Let's ensure all certificates and permits are up to date and readily accessible for inspection.\",\n        linkedDocuments: null\n      )\n    }\n  ),\n  a!map(\n    caseType: \"Solar Permit (DEMO)\",\n    taskTitle: \"Electrical Inspection\",\n    parentComment: a!map(\n      commentText: \"Has the electrical load calculation been completed and documented for the residential permit case? We need it for the electrical inspection.\",\n      linkedDocuments: null,\n      isBookmarked: false\n    ),\n    childComments: {\n      a!map(\n        commentText: \"The electrical load calculation is in progress. I'll ensure you receive the finalized report and any necessary documentation as soon as it's completed.Here is the initial draft.\",\n        linkedDocuments: {\n          \"Technical Specifications for Permit Solar\",\n          \"Structural Criteria for Solar Permit\"\n        }\n      )\n    }\n  )\n}",
  "calls": [],
  "called_by": []
}