{
  "uuid": "_a-0000ee30-0c37-8000-9d90-011c48011c48_4471649",
  "name": "CMGT_EXT_DATA_FraudulentTransactions_EmailTemplates",
  "type": "Expression Rule",
  "description": "Rule to return email templates for Fraudulent Transactions category and case types",
  "sail_code": "{\n  a!map(\n    templateName: \"Credit Card Dispute Approval\",\n    subject: \"Your Credit Card Dispute Has Been Resolved - Approved\",\n    body: \"<p>Hello,</p><p></p><p>We are writing to inform you that the credit card dispute you submitted regarding your transaction has been resolved and approved.</p><p></p><p>Following our review of the information you provided and our investigation, we have determined that your dispute is valid. As a result, a credit has been applied to your credit card.</p><p></p><p>You should see this credit reflected in your account statement within 7 business days. Please note that the exact timing may vary depending on your card issuer&#39;s processing procedures.</p><p></p><p>We understand that dealing with disputed transactions can be frustrating, and we appreciate your patience during this process. We hope this resolution is satisfactory.</p><p></p><p>If you have any further questions or concerns, please do not hesitate to contact us by replying to this email.</p><p></p><p>Sincerely,</p><p>The Acme Corp. Team</p>\",\n    emailTemplateUuid: \"fb901851-3eaf-47ea-9758-4be332b54359\" \n  ),\n  a!map(\n    templateName: \"Credit Card Dispute Rejected\",\n    subject: \"Your Credit Card Dispute Has Been Resolved - Rejected\",\n    body: \"<p>Hello,<br /><br />We are writing to inform you about the status of the credit card dispute you submitted regarding your transaction.<br /><br />Following a thorough review of the information you provided and our subsequent investigation, we have unfortunately determined that we are unable to approve your dispute at this time.<br /><br />Our investigation did not reveal sufficient evidence to support your claim. The information provided did not clearly demonstrate the discrepancy you described.<br /><br />Contact your credit card issuer directly to explore further options.<br /><br />If you have any questions about this decision or would like further clarification, please do not hesitate to contact us by replying to this email.<br /><br />Sincerely,<br />The Acme Corp. Team</p>\",\n    emailTemplateUuid: \"81707877-a482-4575-b27d-9a9952976ffe\" \n  )\n}",
  "calls": [],
  "called_by": []
}